Inter vlan configure:
switch0:
Switch>en
Switch#sh vlan br
Switch#conf t
Switch(config)#vlan 2
Switch(config-vlan)#name IT
Switch(config-vlan)#vlan 3
Switch(config-vlan)#name HR

Switch#conf t
Switch(config)#int range fa0/1-2	
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit

Switch(config)#int range fa0/3-4
Switch(config-if-range)#switchport access vlan 3

Router1:
Switch>en
Switch#sh vlan br
Switch#conf t
Switch(config)#vlan 2
Switch(config-vlan)#name IT
Switch(config-vlan)#vlan 3
Switch(config-vlan)#name HR

Switch#conf t
Switch(config)#int range fa0/1-2	
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit

Switch(config)#int range fa0/3-4
Switch(config-if-range)#switchport access vlan 3

Trunking:
Switch0:
Switch#sh int switchport
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range fa0/1-4
Switch(config-if-range)#switchport mode access

Switch#conf t
Switch(config)#int fa0/5
Switch(config-if)#switchport mode trunk
Switch#sh int trunk

Switch1:
Switch#conf t
Switch(config)#int fa0/6
Switch(config-if)#switchport mode trunk
Switch#sh int trunk


Router0:
Router>en
Router#conf t
Router(config)#int fa0/0
Router(config-if)#no shut

Router(config-if)#exit
Router(config)#int fa0/0.1
Router(config-subif)#encapsulation dot1Q 2
Router(config-subif)#ip address 192.168.100.1 255.255.255.248
Router(config-subif)#exit
Router(config)#int fa0/0.2

Router(config-subif)#encapsulation dot1Q 3
Router(config-subif)#ip address 192.168.100.9 255.255.255.248

